rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
/**
 ******************************************************************************
 * @file    usbh_hid.c
 * @author  MCD Application Team
 * @brief   This file is the HID Layer Handlers for USB Host HID class.
 *
 * @verbatim
 *
 *          ===================================================================
 *                                HID Class  Description
 *          ===================================================================
 *           This module manages the HID class V1.11 following the "Device Class Definition
 *           for Human Interface Devices (HID) Version 1.11 Jun 27, 2001".
 *           This driver implements the following aspects of the specification:
 *             - The Boot Interface Subclass
 *             - The Mouse and Keyboard protocols
 *
 *  @endverbatim
 *
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                      www.st.com/SLA0044
 *
 ******************************************************************************
 */

/* BSPDependencies
 - "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
 - "stm32xxxxx_{eval}{discovery}_io.c"
 - "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
 - "stm32xxxxx_{eval}{discovery}_sdram.c"
 EndBSPDependencies */

/* Includes ------------------------------------------------------------------*/
#include "usbh_core.h"
#include "usbh_hid.h"
#include "usbh_hid_parser.h"
//#include "main.h"

/** @addtogroup USBH_LIB
 * @{
 */

/** @addtogroup USBH_CLASS
 * @{
 */

/** @addtogroup USBH_HID_CLASS
 * @{
 */

/** @defgroup USBH_HID_CORE
 * @brief    This file includes HID Layer Handlers for USB Host HID class.
 * @{
 */

/** @defgroup USBH_HID_CORE_Private_TypesDefinitions
 * @{
 */
/**
 * @}
 */

/** @defgroup USBH_HID_CORE_Private_Defines
 * @{
 */
/**
 * @}
 */

/** @defgroup USBH_HID_CORE_Private_Macros
 * @{
 */
/**
 * @}
 */

/** @defgroup USBH_HID_CORE_Private_Variables
 * @{
 */

/**
 * @}
 */

/** @defgroup USBH_HID_CORE_Private_FunctionPrototypes
 * @{
 */

static USBH_StatusTypeDef USBH_HID_InterfaceInit(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost);
static void USBH_HID_IncrementInterface(USBH_HandleTypeDef *phost);
static uint8_t USB_Get_Keyboard_LED_Status(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USB_Set_Keyboard_LED_Status(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost);
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost);
static void USBH_HID_ParseHIDDesc(HID_DescTypeDef *desc, uint8_t *buf);

extern USBH_StatusTypeDef USBH_HID_MouseInit(USBH_HandleTypeDef *phost);
extern USBH_StatusTypeDef USBH_HID_KeybdInit(USBH_HandleTypeDef *phost);

USBH_ClassTypeDef HID_Class = { "HID", USB_HID_CLASS, USBH_HID_InterfaceInit,
		USBH_HID_InterfaceDeInit, USBH_HID_ClassRequest, USBH_HID_Process,
		USBH_HID_SOFProcess };

//USBH_ClassTypeDef HID_Class = { "HID",
//USB_HID_CLASS, USBH_HID_InterfaceInit, USBH_HID_InterfaceDeInit,
//		USBH_HID_ClassRequest, USBH_HID_Process, USBH_HID_SOFProcess,
//		NULL, };
/**
 * @}
 */

/** @defgroup USBH_HID_CORE_Private_Functions
 * @{
 */

/**
 * @brief  USBH_HID_InterfaceInit
 *         The function init the HID class.
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_InterfaceInit(USBH_HandleTypeDef *phost) {
	USBH_StatusTypeDef status;
	HID_HandleTypeDef *HID_Handle;
	uint8_t max_ep;
	uint8_t ep_index = 0U;
	uint8_t interface_check;
	uint8_t interface_index;

	USBH_UsrLog("USBH_HID_InterfaceInit");

	// dump everything
	uint8_t num_interfaces = phost->device.CfgDesc.bNumInterfaces;

	for (interface_index = 0; interface_index < num_interfaces;
			interface_index++) {

		interface_check = USBH_CheckInterface(phost, interface_index,
				phost->pActiveClass->ClassCode, HID_BOOT_CODE, 0xFFU);

		// USBH_UsrLog("interface_check: %d", interface_check);

		if ((interface_check == 0xFFU)
				|| (interface_check >= USBH_MAX_NUM_INTERFACES)) /* No Valid Interface */
				{
			phost->device.skip_interface = 1;
			USBH_UsrLog("Interface %d, cannot find the HID_BOOT_CODE, skip",
					interface_index);
			USBH_UsrLog("(This interface can be for multimedia)\n");
			//return USBH_FAIL;

			HID_Handle =
					(HID_HandleTypeDef*) phost->pActiveClass->pData_array[interface_index];
			//return USBH_OK;
		} else {
			phost->device.skip_interface = 0;
			status = USBH_SelectInterface(phost, interface_index);

			if (status != USBH_OK) {
				return USBH_FAIL;
			}

			USBH_UsrLog("Class    : %xh",
					phost->device.CfgDesc.Itf_Desc[interface_index].bInterfaceClass);
			USBH_UsrLog("SubClass : %xh",
					phost->device.CfgDesc.Itf_Desc[interface_index].bInterfaceSubClass);
			USBH_UsrLog("Protocol : %xh",
					phost->device.CfgDesc.Itf_Desc[interface_index].bInterfaceProtocol);

			phost->pActiveClass->pData_array[interface_index] =
					(HID_HandleTypeDef*) USBH_malloc(sizeof(HID_HandleTypeDef));
			HID_Handle =
					(HID_HandleTypeDef*) phost->pActiveClass->pData_array[interface_index];

			if (HID_Handle == NULL) {
				USBH_DbgLog("Cannot allocate memory for HID Handle");
				return USBH_FAIL;
			}

			/* Initialize hid handler */
			(void) USBH_memset(HID_Handle, 0, sizeof(HID_HandleTypeDef));

			HID_Handle->state = HID_ERROR;

			/*Decode Bootclass Protocol: Mouse or Keyboard*/
			uint8_t Iprot =
					phost->device.CfgDesc.Itf_Desc[interface_index].bInterfaceProtocol;

			if ((Iprot == HID_KEYBRD_BOOT_CODE)
					|| (Iprot == HID_MOUSE_BOOT_CODE)) {

				if (Iprot == HID_KEYBRD_BOOT_CODE) {
					USBH_UsrLog("KeyBoard device found!");
					HID_Handle->Init = USBH_HID_KeybdInit;
					HID_Handle->state = HID_INIT;
					HID_Handle->ctl_state = HID_REQ_INIT;

					if (USBH_KEYBOARD_LED_NUM_LOCK_START == 1U) {
						phost->device.kbd_LED_status = 0xFFU;
					}

				} else { // if (Iprot == HID_MOUSE_BOOT_CODE) {
					USBH_UsrLog("Mouse device found!");
					HID_Handle->Init = USBH_HID_MouseInit;
					HID_Handle->state = HID_INIT;
					HID_Handle->ctl_state = HID_REQ_INIT;
				}

