rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
				/* Check of available number of endpoints */
				/* Find the number of EPs in the Interface Descriptor */
				/* Choose the lower number in order not to overrun the buffer allocated */
				if (phost->device.CfgDesc.Itf_Desc[interface_index].bNumEndpoints
						<= USBH_MAX_NUM_ENDPOINTS) {
					max_ep =
							phost->device.CfgDesc.Itf_Desc[interface_index].bNumEndpoints;
				} else {
					max_ep = USBH_MAX_NUM_ENDPOINTS;
				}

				USBH_UsrLog("max_ep: %d", max_ep);

				/* Decode endpoint IN and OUT address from interface descriptor */
				for (ep_index = 0U; ep_index < max_ep; ep_index++) {
					USBH_InterfaceDescTypeDef *interface_x =
							&phost->device.CfgDesc.Itf_Desc[interface_index];

					USBH_EpDescTypeDef *ep_desc =
							&interface_x->Ep_Desc[ep_index];

					if (ep_desc->bEndpointAddress & 0x80U) {
						HID_Handle->InEp =
								(phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bEndpointAddress);
						HID_Handle->InPipe = USBH_AllocPipe(phost,
								HID_Handle->InEp);

						HID_Handle->ep_addr_array[0] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bEndpointAddress;
						HID_Handle->length_array[0] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].wMaxPacketSize;
						HID_Handle->poll_array[0] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bInterval;

						if (HID_Handle->poll_array[0] < HID_MIN_POLL) {
							HID_Handle->poll_array[0] = HID_MIN_POLL;
						}

						/* Open pipe for IN endpoint */
						(void) USBH_OpenPipe(phost, HID_Handle->InPipe,
								HID_Handle->InEp, phost->device.address,
								phost->device.speed, USB_EP_TYPE_INTR,
								HID_Handle->length_array[0]);

						(void) USBH_LL_SetToggle(phost, HID_Handle->InPipe, 0U);
					} else {
						HID_Handle->OutEp =
								(phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bEndpointAddress);
						HID_Handle->OutPipe = USBH_AllocPipe(phost,
								HID_Handle->OutEp);

						HID_Handle->ep_addr_array[1] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bEndpointAddress;
						HID_Handle->length_array[1] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].wMaxPacketSize;
						HID_Handle->poll_array[1] =
								phost->device.CfgDesc.Itf_Desc[interface_index].Ep_Desc[ep_index].bInterval;

						if (HID_Handle->poll_array[1] < HID_MIN_POLL) {
							HID_Handle->poll_array[1] = HID_MIN_POLL;
						}

						/* Open pipe for OUT endpoint */
						(void) USBH_OpenPipe(phost, HID_Handle->OutPipe,
								HID_Handle->OutEp, phost->device.address,
								phost->device.speed, USB_EP_TYPE_INTR,
								HID_Handle->length_array[1]);

						(void) USBH_LL_SetToggle(phost, HID_Handle->OutPipe,
								0U);
					}

					USBH_UsrLog(
							"Interface %u, endpoint #%u: address 0x%02x, attributes 0x%02x\n",
							interface_index, ep_index,
							ep_desc->bEndpointAddress, ep_desc->bmAttributes);
				}
			} else {
				USBH_UsrLog("Protocol not supported.");
				phost->device.skip_interface = 1;
				//return USBH_FAIL;
			}
		}
	}

	interface_index = 0;

	status = USBH_SelectInterface(phost, interface_index);

	if (status != USBH_OK) {
		return USBH_FAIL;
	}

	return USBH_OK;
}

/**
 * @brief  USBH_HID_InterfaceDeInit
 *         The function DeInit the Pipes used for the HID class.
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_InterfaceDeInit(USBH_HandleTypeDef *phost) {
	uint8_t idx = 0;

	for (; idx < phost->device.CfgDesc.bNumInterfaces; ++idx) {
		HID_HandleTypeDef *HID_Handle =
				(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

		if (HID_Handle->InPipe != 0x00U) {
			(void) USBH_ClosePipe(phost, HID_Handle->InPipe);
			(void) USBH_FreePipe(phost, HID_Handle->InPipe);
			HID_Handle->InPipe = 0U; /* Reset the pipe as Free */
		}

		if (HID_Handle->OutPipe != 0x00U) {
			(void) USBH_ClosePipe(phost, HID_Handle->OutPipe);
			(void) USBH_FreePipe(phost, HID_Handle->OutPipe);
			HID_Handle->OutPipe = 0U; /* Reset the pipe as Free */
		}

		if ((phost->pActiveClass->pData_array[idx]) != NULL) {
			USBH_free(phost->pActiveClass->pData_array[idx]);
			phost->pActiveClass->pData_array[idx] = 0U;
		}
	}

	return USBH_OK;
}

/**
 * @brief  USBH_HID_ClassRequest
 *         The function is responsible for handling Standard requests
 *         for HID class.
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_ClassRequest(USBH_HandleTypeDef *phost) {

	USBH_StatusTypeDef status = USBH_BUSY;
	USBH_StatusTypeDef classReqStatus = USBH_BUSY;
	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[0];

	/* Switch HID state machine */
	switch (HID_Handle->ctl_state) {
	case HID_REQ_INIT:
	case HID_REQ_GET_HID_DESC:

		USBH_HID_ParseHIDDesc(&HID_Handle->HID_Desc, phost->device.CfgDesc_Raw);

		HID_Handle->ctl_state = HID_REQ_GET_REPORT_DESC;

		break;
	case HID_REQ_GET_REPORT_DESC:

		/* Get Report Desc */
		classReqStatus = USBH_HID_GetHIDReportDescriptor(phost,
				HID_Handle->HID_Desc.wItemLength);
		if (classReqStatus == USBH_OK) {
			/* The descriptor is available in phost->device.Data */
			HID_Handle->ctl_state = HID_REQ_SET_IDLE;
		} else if (classReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: HID: Device Get Report Descriptor request failed");
			status = USBH_FAIL;
		} else {
			/* .. */
		}

		break;

	case HID_REQ_SET_IDLE:

		classReqStatus = USBH_HID_SetIdle(phost, 0U, 0U);

		/* set Idle */
		if (classReqStatus == USBH_OK) {
			HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
		} else {
			if (classReqStatus == USBH_NOT_SUPPORTED) {
				HID_Handle->ctl_state = HID_REQ_SET_PROTOCOL;
			}
		}
		break;

	case HID_REQ_SET_PROTOCOL:
		/* set protocol */
		classReqStatus = USBH_HID_SetProtocol(phost, 0U);
		if (classReqStatus == USBH_OK) {
			HID_Handle->ctl_state = HID_REQ_IDLE;

