rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
			/* all requests performed*/
			phost->pUser(phost, HOST_USER_CLASS_ACTIVE);
			status = USBH_OK;
		} else if (classReqStatus == USBH_NOT_SUPPORTED) {
			USBH_ErrLog(
					"Control error: HID: Device Set protocol request failed");
			status = USBH_FAIL;
		} else {
			/* .. */
		}
		break;
	case HID_REQ_IDLE:
	default:
		break;
	}

	return status;
}

static void USBH_HID_IncrementInterface(USBH_HandleTypeDef *phost) {
	uint8_t max_loop = phost->device.CfgDesc.bNumInterfaces;

	while (max_loop--) {
		// switch interface
		phost->device.current_interface++;

		if (phost->device.current_interface
				>= phost->device.CfgDesc.bNumInterfaces) {
			phost->device.current_interface = 0;
		}

		if (phost->device.skip_interface == 0) {
//			USBH_UsrLog("current_interface: %d",
//					phost->device.current_interface);
			break;
		}
	}
}

static uint8_t USB_Get_Keyboard_LED_Status(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->Init != USBH_HID_KeybdInit) {
		return 0xFF;
	}

	USBH_StatusTypeDef status;

	for (uint8_t timeout = 0U; timeout < 15; timeout++) {
		status = USBH_HID_GetReport(phost, 0x02U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);

		if (status == USBH_OK) {
			//USBH_UsrLog("USBH_OK USBH_OK");
			return HID_Handle->pData[0];
		}

		USBH_Delay(1);
	}

	return 0xFF;
}

static USBH_StatusTypeDef USB_Set_Keyboard_LED_Status(USBH_HandleTypeDef *phost) {
	if ((USBH_GetTick() - phost->device.kbd_led_status_tick) < 100) {
		return HAL_OK;
	}

	phost->device.kbd_led_status_tick = USBH_GetTick();

	if (phost->device.kbd_LED_status == 0xFFU) {
		phost->device.kbd_LED_status = 0b001U;
	}

	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->Init != USBH_HID_KeybdInit) {
		return HAL_OK;
	}

	uint8_t LED_status = phost->device.kbd_LED_status & 7U;

	HID_Handle->pData[0] = LED_status;
	HID_Handle->pData[1] = 0;

	USBH_StatusTypeDef status_set;

	for (uint8_t timeout = 0U; timeout < 15U; timeout++) {
		status_set = USBH_HID_SetReport(phost, 0x02U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);

		USBH_Delay(1);

		if (status_set == USBH_OK) {
			break;
		}
	}

	if (status_set == USBH_OK) {
		uint8_t status_get = USB_Get_Keyboard_LED_Status(phost);

		if (status_get == LED_status) {
			return USBH_OK;
		}
	}

	return USBH_NOT_SUPPORTED;
}

/**
 * @brief  USBH_HID_Process
 *         The function is for managing state machine for HID data transfers
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_Process(USBH_HandleTypeDef *phost) {
	USBH_StatusTypeDef status = USBH_OK;

	uint8_t URBState;

	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	uint32_t XferSize;

	switch (HID_Handle->state) {
	case HID_INIT:
		//USBH_UsrLog("HID_INIT");
		HID_Handle->Init(phost);
		HID_Handle->state = HID_IDLE;
		HID_Handle->Timeout = USBH_GetTick();

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_IDLE:
		//USBH_UsrLog("HID_IDLE");
		status = USBH_HID_GetReport(phost, 0x01U, 0U, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0]);
		if (status == USBH_OK) {
			HID_Handle->state = HID_SYNC;
		} else if (status == USBH_BUSY) {
			HID_Handle->state = HID_IDLE;
			status = USBH_OK;
		} else if (status == USBH_NOT_SUPPORTED) {
			HID_Handle->state = HID_SYNC;
			status = USBH_OK;
		} else {
			HID_Handle->state = HID_ERROR;
			status = USBH_FAIL;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_SYNC:
		//USBH_UsrLog("HID_SYNC");
		/* Sync with start of Even Frame */
		if ((phost->Timer & 1U) != 0U) {
			HID_Handle->state = HID_GET_DATA;
		}

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
		break;

	case HID_GET_DATA:
		//USBH_UsrLog("HID_GET_DATA");
		(void) USBH_InterruptReceiveData(phost, HID_Handle->pData,
				(uint8_t) HID_Handle->length_array[0], HID_Handle->InPipe);

		HID_Handle->state = HID_POLL;
		HID_Handle->timer = phost->Timer;
		HID_Handle->DataReady = 0U;
		break;

	case HID_POLL:
		//USBH_UsrLog("HID_POLL");
		URBState = (uint8_t) USBH_LL_GetURBState(phost, HID_Handle->InPipe);

		if (URBState == USBH_URB_DONE) {
			//USBH_UsrLog("USBH_URB_DONE, interface: %d", idx);
			XferSize = USBH_LL_GetLastXferSize(phost, HID_Handle->InPipe);

			if ((HID_Handle->DataReady == 0U) && (XferSize != 0U)) {
				(void) USBH_HID_FifoWrite(&HID_Handle->fifo, HID_Handle->pData,
						HID_Handle->length_array[0]);
				HID_Handle->DataReady = 1U;
				USBH_HID_EventCallback(phost);

#if (USBH_USE_OS == 1U)
          phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
          (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
          (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif
			}
		} else if (URBState == USBH_URB_STALL) {
			// USBH_UsrLog("USBH_URB_STALL");
			/* Issue Clear Feature on interrupt IN endpoint */
			if (USBH_ClrFeature(phost, HID_Handle->ep_addr_array[0])
					== USBH_OK) {
				/* Change state to issue next IN token */
				HID_Handle->state = HID_GET_DATA;

				// switch interface
				USBH_HID_IncrementInterface(phost);

