rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
				// USBH_UsrLog("current_interface: %d",
				//		phost->device.current_interface);
			}

		} else {
			if (URBState == USBH_URB_ERROR) {

				USBH_ErrLog("USBH_URB_ERROR");
			} else if (URBState == USBH_URB_NOTREADY) {
				USBH_UsrLog("USBH_URB_NOTREADY");
			} else if (URBState == USBH_URB_NYET) {
				USBH_UsrLog("USBH_URB_NYET");
			} else {
				if (URBState != USBH_URB_IDLE) {
					USBH_UsrLog("URBState: %d", URBState);
				}
			}

			if (URBState != USBH_URB_IDLE) {
				if ((USBH_GetTick() - HID_Handle->Timeout)
						> USBH_DEV_RESET_TIMEOUT) {
					//USBH_UsrLog("USB Configuration Failed, Please unplug the Device.");
					HID_Handle->state = HID_ERROR;
					HID_Handle->Timeout = USBH_GetTick(); //0;
				}
			} else {
				(void)USB_Set_Keyboard_LED_Status(phost);
			}
		}
		break;
	case HID_ERROR:
		USBH_UsrLog("HID_ERROR");
		USBH_RecoveryPhost(phost);
		break;
	default:
		break;
	}

	return status;
}

/**
 * @brief  USBH_HID_SOFProcess
 *         The function is for managing the SOF Process
 * @param  phost: Host handle
 * @retval USBH Status
 */
static USBH_StatusTypeDef USBH_HID_SOFProcess(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if (HID_Handle->state == HID_POLL) {
		if ((phost->Timer - HID_Handle->timer) >= HID_Handle->poll_array[0]) {
			HID_Handle->state = HID_GET_DATA;

#if (USBH_USE_OS == 1U)
      phost->os_msg = (uint32_t)USBH_URB_EVENT;
#if (osCMSIS < 0x20000U)
      (void)osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
      (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, 0U);
#endif
#endif

			// switch interface
			USBH_HID_IncrementInterface(phost);
		}
	}
	return USBH_OK;
}

/**
 * @brief  USBH_Get_HID_ReportDescriptor
 *         Issue report Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Report Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDReportDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {

	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID_REPORT, phost->device.Data, length);

	/* HID report descriptor is available in phost->device.Data.
	 In case of USB Boot Mode devices for In report handling ,
	 HID report descriptor parsing is not required.
	 In case, for supporting Non-Boot Protocol devices and output reports,
	 user may parse the report descriptor*/

	return status;
}

/**
 * @brief  USBH_Get_HID_Descriptor
 *         Issue HID Descriptor command to the device. Once the response
 *         received, parse the report descriptor and update the status.
 * @param  phost: Host handle
 * @param  Length : HID Descriptor Length
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetHIDDescriptor(USBH_HandleTypeDef *phost,
		uint16_t length) {
	USBH_StatusTypeDef status;

	status = USBH_GetDescriptor(phost,
	USB_REQ_RECIPIENT_INTERFACE | USB_REQ_TYPE_STANDARD,
	USB_DESC_HID, phost->device.Data, length);

	return status;
}

/**
 * @brief  USBH_Set_Idle
 *         Set Idle State.
 * @param  phost: Host handle
 * @param  duration: Duration for HID Idle request
 * @param  reportId : Targeted report ID for Set Idle request
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_SetIdle(USBH_HandleTypeDef *phost, uint8_t duration,
		uint8_t reportId) {

	phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
			|
			USB_REQ_TYPE_CLASS;

	phost->Control.setup.b.bRequest = USB_HID_SET_IDLE;
	phost->Control.setup.b.wValue.w = (uint16_t) (((uint32_t) duration << 8U)
			| (uint32_t) reportId);

	phost->Control.setup.b.wIndex.w = 0U;
	phost->Control.setup.b.wLength.w = 0U;

	return USBH_CtlReq(phost, NULL, 0U);
}

/**
 * @brief  USBH_HID_Set_Report
 *         Issues Set Report
 * @param  phost: Host handle
 * @param  reportType  : Report type to be sent
 * @param  reportId    : Targeted report ID for Set Report request
 * @param  reportBuff  : Report Buffer
 * @param  reportLen   : Length of data report to be send
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_SetReport(USBH_HandleTypeDef *phost,
		uint8_t reportType, uint8_t reportId, uint8_t *reportBuff,
		uint8_t reportLen) {

	phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
			|
			USB_REQ_TYPE_CLASS;

	phost->Control.setup.b.bRequest = USB_HID_SET_REPORT;
	phost->Control.setup.b.wValue.w = (uint16_t) (((uint32_t) reportType << 8U)
			| (uint32_t) reportId);

	phost->Control.setup.b.wIndex.w = 0U;
	phost->Control.setup.b.wLength.w = reportLen;

	return USBH_CtlReq(phost, reportBuff, (uint16_t) reportLen);
}

/**
 * @brief  USBH_HID_GetReport
 *         retrieve Set Report
 * @param  phost: Host handle
 * @param  reportType  : Report type to be sent
 * @param  reportId    : Targeted report ID for Set Report request
 * @param  reportBuff  : Report Buffer
 * @param  reportLen   : Length of data report to be send
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_GetReport(USBH_HandleTypeDef *phost,
		uint8_t reportType, uint8_t reportId, uint8_t *reportBuff,
		uint8_t reportLen) {

	phost->Control.setup.b.bmRequestType = USB_D2H | USB_REQ_RECIPIENT_INTERFACE
			|
			USB_REQ_TYPE_CLASS;

	phost->Control.setup.b.bRequest = USB_HID_GET_REPORT;
	phost->Control.setup.b.wValue.w = (uint16_t) (((uint32_t) reportType << 8U)
			| (uint32_t) reportId);

	phost->Control.setup.b.wIndex.w = 0U;
	phost->Control.setup.b.wLength.w = reportLen;

	return USBH_CtlReq(phost, reportBuff, (uint16_t) reportLen);
}

/**
 * @brief  USBH_Set_Protocol
 *         Set protocol State.
 * @param  phost: Host handle
 * @param  protocol : Set Protocol for HID : boot/report protocol
 * @retval USBH Status
 */
USBH_StatusTypeDef USBH_HID_SetProtocol(USBH_HandleTypeDef *phost,
		uint8_t protocol) {
	phost->Control.setup.b.bmRequestType = USB_H2D | USB_REQ_RECIPIENT_INTERFACE
			| USB_REQ_TYPE_CLASS;

