rtek1000/STM32F4HUB_modified/Project-STM32CubeIDE_USBH_ASC/F407_USBH_ASC/Middlewares/ST/STM32_USB_Host_Library/Class/HID/Src/usbh_hid.c
	phost->Control.setup.b.bRequest = USB_HID_SET_PROTOCOL;
	if (protocol != 0U) {
		phost->Control.setup.b.wValue.w = 0U;
	} else {
		phost->Control.setup.b.wValue.w = 1U;
	}

	phost->Control.setup.b.wIndex.w = 0U;
	phost->Control.setup.b.wLength.w = 0U;

	return USBH_CtlReq(phost, NULL, 0U);

}

/**
 * @brief  USBH_ParseHIDDesc
 *         This function Parse the HID descriptor
 * @param  desc: HID Descriptor
 * @param  buf: Buffer where the source descriptor is available
 * @retval None
 */
static void USBH_HID_ParseHIDDesc(HID_DescTypeDef *desc, uint8_t *buf) {
	USBH_DescHeader_t *pdesc = (USBH_DescHeader_t*) buf;
	uint16_t CfgDescLen;
	uint16_t ptr;

	CfgDescLen = LE16(buf + 2U);

	if (CfgDescLen > USB_CONFIGURATION_DESC_SIZE) {
		ptr = USB_LEN_CFG_DESC;

		while (ptr < CfgDescLen) {
			pdesc = USBH_GetNextDesc((uint8_t*) pdesc, &ptr);

			if (pdesc->bDescriptorType == USB_DESC_TYPE_HID) {
				desc->bLength = *(uint8_t*) ((uint8_t*) pdesc + 0U);
				desc->bDescriptorType = *(uint8_t*) ((uint8_t*) pdesc + 1U);
				desc->bcdHID = LE16((uint8_t* )pdesc + 2U);
				desc->bCountryCode = *(uint8_t*) ((uint8_t*) pdesc + 4U);
				desc->bNumDescriptors = *(uint8_t*) ((uint8_t*) pdesc + 5U);
				desc->bReportDescriptorType =
						*(uint8_t*) ((uint8_t*) pdesc + 6U);
				desc->wItemLength = LE16((uint8_t* )pdesc + 7U);
				break;
			}
		}
	}
}

/**
 * @brief  USBH_HID_GetDeviceType
 *         Return Device function.
 * @param  phost: Host handle
 * @retval HID function: HID_MOUSE / HID_KEYBOARD
 */
HID_TypeTypeDef USBH_HID_GetDeviceType(USBH_HandleTypeDef *phost) {
	HID_TypeTypeDef type = HID_UNKNOWN;
	uint8_t InterfaceProtocol;

	if (phost->gState == HOST_CLASS) {
		InterfaceProtocol =
				phost->device.CfgDesc.Itf_Desc[phost->device.current_interface].bInterfaceProtocol;
		if (InterfaceProtocol == HID_KEYBRD_BOOT_CODE) {
			type = HID_KEYBOARD;
		} else {
			if (InterfaceProtocol == HID_MOUSE_BOOT_CODE) {
				type = HID_MOUSE;
			}
		}
	}
	return type;
}

/**
 * @brief  USBH_HID_GetPollInterval
 *         Return HID device poll time
 * @param  phost: Host handle
 * @retval poll time (ms)
 */
uint8_t USBH_HID_GetPollInterval(USBH_HandleTypeDef *phost) {
	uint8_t idx = phost->device.current_interface;

	HID_HandleTypeDef *HID_Handle =
			(HID_HandleTypeDef*) phost->pActiveClass->pData_array[idx];

	if ((phost->gState == HOST_CLASS_REQUEST) || (phost->gState == HOST_INPUT)
			|| (phost->gState == HOST_SET_CONFIGURATION)
			|| (phost->gState == HOST_CHECK_CLASS)
			|| ((phost->gState == HOST_CLASS))) {
		return (uint8_t) (HID_Handle->poll_array[0]);
	} else {
		return 0U;
	}
}
/**
 * @brief  USBH_HID_FifoInit
 *         Initialize FIFO.
 * @param  f: Fifo address
 * @param  buf: Fifo buffer
 * @param  size: Fifo Size
 * @retval none
 */
void USBH_HID_FifoInit(FIFO_TypeDef *f, uint8_t *buf, uint16_t size) {
	f->head = 0U;
	f->tail = 0U;
	f->lock = 0U;
	f->size = size;
	f->buf = buf;
}

/**
 * @brief  USBH_HID_FifoRead
 *         Read from FIFO.
 * @param  f: Fifo address
 * @param  buf: read buffer
 * @param  nbytes: number of item to read
 * @retval number of read items
 */
uint16_t USBH_HID_FifoRead(FIFO_TypeDef *f, void *buf, uint16_t nbytes) {
	uint16_t i;
	uint8_t *p;

	p = (uint8_t*) buf;

	if (f->lock == 0U) {
		f->lock = 1U;

		for (i = 0U; i < nbytes; i++) {
			if (f->tail != f->head) {
				*p++ = f->buf[f->tail];
				f->tail++;

				if (f->tail == f->size) {
					f->tail = 0U;
				}
			} else {
				f->lock = 0U;
				return i;
			}
		}
	}

	f->lock = 0U;

	return nbytes;
}

/**
 * @brief  USBH_HID_FifoWrite
 *         Write To FIFO.
 * @param  f: Fifo address
 * @param  buf: read buffer
 * @param  nbytes: number of item to write
 * @retval number of written items
 */
uint16_t USBH_HID_FifoWrite(FIFO_TypeDef *f, void *buf, uint16_t nbytes) {
	uint16_t i;
	uint8_t *p;

	p = (uint8_t*) buf;

	if (f->lock == 0U) {
		f->lock = 1U;

		for (i = 0U; i < nbytes; i++) {
			if (((f->head + 1U) == f->tail)
					|| (((f->head + 1U) == f->size) && (f->tail == 0U))) {
				f->lock = 0U;
				return i;
			} else {
				f->buf[f->head] = *p++;
				f->head++;

				if (f->head == f->size) {
					f->head = 0U;
				}
			}
		}
	}

	f->lock = 0U;

	return nbytes;
}

/**
 * @brief  The function is a callback about HID Data events
 *  @param  phost: Selected device
 * @retval None
 */
__weak void USBH_HID_EventCallback(USBH_HandleTypeDef *phost) {
	/* Prevent unused argument(s) compilation warning */
	UNUSED(phost);
}
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
